# ShapeImporter Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ShapeImporter Constructor
ShapeImporter Class See Also
---
Default constructor. Initializes an instance of ShapeImporter that will automatically recognize the file format from its extension (ShapeImporterSourceFormat.Auto).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ShapeImporter()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ShapeImporter()
```

# See Also
ShapeImporter Class
Autodesk.Revit.DB Namespace